MikroElektronika/core_packages/PIC/XC8/def/PIC18LF47K40/mcu.h
extern volatile TMR5Hbits_t TMR5Hbits __at(0xFC2);
// bitfield macros
#define _TMR5H_TMR5H0_POSN                                  0x0
#define _TMR5H_TMR5H0_POSITION                              0x0
#define _TMR5H_TMR5H0_SIZE                                  0x1
#define _TMR5H_TMR5H0_LENGTH                                0x1
#define _TMR5H_TMR5H0_MASK                                  0x1
#define _TMR5H_TMR5H1_POSN                                  0x1
#define _TMR5H_TMR5H1_POSITION                              0x1
#define _TMR5H_TMR5H1_SIZE                                  0x1
#define _TMR5H_TMR5H1_LENGTH                                0x1
#define _TMR5H_TMR5H1_MASK                                  0x2
#define _TMR5H_TMR5H2_POSN                                  0x2
#define _TMR5H_TMR5H2_POSITION                              0x2
#define _TMR5H_TMR5H2_SIZE                                  0x1
#define _TMR5H_TMR5H2_LENGTH                                0x1
#define _TMR5H_TMR5H2_MASK                                  0x4
#define _TMR5H_TMR5H3_POSN                                  0x3
#define _TMR5H_TMR5H3_POSITION                              0x3
#define _TMR5H_TMR5H3_SIZE                                  0x1
#define _TMR5H_TMR5H3_LENGTH                                0x1
#define _TMR5H_TMR5H3_MASK                                  0x8
#define _TMR5H_TMR5H4_POSN                                  0x4
#define _TMR5H_TMR5H4_POSITION                              0x4
#define _TMR5H_TMR5H4_SIZE                                  0x1
#define _TMR5H_TMR5H4_LENGTH                                0x1
#define _TMR5H_TMR5H4_MASK                                  0x10
#define _TMR5H_TMR5H5_POSN                                  0x5
#define _TMR5H_TMR5H5_POSITION                              0x5
#define _TMR5H_TMR5H5_SIZE                                  0x1
#define _TMR5H_TMR5H5_LENGTH                                0x1
#define _TMR5H_TMR5H5_MASK                                  0x20
#define _TMR5H_TMR5H6_POSN                                  0x6
#define _TMR5H_TMR5H6_POSITION                              0x6
#define _TMR5H_TMR5H6_SIZE                                  0x1
#define _TMR5H_TMR5H6_LENGTH                                0x1
#define _TMR5H_TMR5H6_MASK                                  0x40
#define _TMR5H_TMR5H7_POSN                                  0x7
#define _TMR5H_TMR5H7_POSITION                              0x7
#define _TMR5H_TMR5H7_SIZE                                  0x1
#define _TMR5H_TMR5H7_LENGTH                                0x1
#define _TMR5H_TMR5H7_MASK                                  0x80
#define _TMR5H_TMR5H_POSN                                   0x0
#define _TMR5H_TMR5H_POSITION                               0x0
#define _TMR5H_TMR5H_SIZE                                   0x8
#define _TMR5H_TMR5H_LENGTH                                 0x8
#define _TMR5H_TMR5H_MASK                                   0xFF
#define _TMR5H_TMR58_POSN                                   0x0
#define _TMR5H_TMR58_POSITION                               0x0
#define _TMR5H_TMR58_SIZE                                   0x1
#define _TMR5H_TMR58_LENGTH                                 0x1
#define _TMR5H_TMR58_MASK                                   0x1
#define _TMR5H_TMR59_POSN                                   0x1
#define _TMR5H_TMR59_POSITION                               0x1
#define _TMR5H_TMR59_SIZE                                   0x1
#define _TMR5H_TMR59_LENGTH                                 0x1
#define _TMR5H_TMR59_MASK                                   0x2
#define _TMR5H_TMR510_POSN                                  0x2
#define _TMR5H_TMR510_POSITION                              0x2
#define _TMR5H_TMR510_SIZE                                  0x1
#define _TMR5H_TMR510_LENGTH                                0x1
#define _TMR5H_TMR510_MASK                                  0x4
#define _TMR5H_TMR511_POSN                                  0x3
#define _TMR5H_TMR511_POSITION                              0x3
#define _TMR5H_TMR511_SIZE                                  0x1
#define _TMR5H_TMR511_LENGTH                                0x1
#define _TMR5H_TMR511_MASK                                  0x8
#define _TMR5H_TMR512_POSN                                  0x4
#define _TMR5H_TMR512_POSITION                              0x4
#define _TMR5H_TMR512_SIZE                                  0x1
#define _TMR5H_TMR512_LENGTH                                0x1
#define _TMR5H_TMR512_MASK                                  0x10
#define _TMR5H_TMR513_POSN                                  0x5
#define _TMR5H_TMR513_POSITION                              0x5
#define _TMR5H_TMR513_SIZE                                  0x1
#define _TMR5H_TMR513_LENGTH                                0x1
#define _TMR5H_TMR513_MASK                                  0x20
#define _TMR5H_TMR514_POSN                                  0x6
#define _TMR5H_TMR514_POSITION                              0x6
#define _TMR5H_TMR514_SIZE                                  0x1
#define _TMR5H_TMR514_LENGTH                                0x1
#define _TMR5H_TMR514_MASK                                  0x40
#define _TMR5H_TMR515_POSN                                  0x7
#define _TMR5H_TMR515_POSITION                              0x7
#define _TMR5H_TMR515_SIZE                                  0x1
#define _TMR5H_TMR515_LENGTH                                0x1
#define _TMR5H_TMR515_MASK                                  0x80

// Register: T5CON
#define T5CON T5CON
extern volatile unsigned char           T5CON               __at(0xFC3);
#ifndef _LIB_BUILD
asm("T5CON equ 0FC3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned NOT_SYNC               :1;
    };
    struct {
        unsigned ON                     :1;
        unsigned RD16                   :1;
        unsigned nSYNC                  :1;
        unsigned                        :1;
        unsigned CKPS                   :2;
    };
    struct {
        unsigned                        :2;
        unsigned NOT_T5SYNC             :1;
    };
    struct {
        unsigned TMR5ON                 :1;
        unsigned T5RD16                 :1;
        unsigned nT5SYNC                :1;
        unsigned                        :1;
        unsigned T5CKPS0                :1;
        unsigned T5CKPS1                :1;
    };
    struct {
        unsigned                        :4;
        unsigned CKPS0                  :1;
        unsigned CKPS1                  :1;
    };
    struct {
        unsigned                        :1;
        unsigned RD165                  :1;
    };
} T5CONbits_t;
extern volatile T5CONbits_t T5CONbits __at(0xFC3);
// bitfield macros
#define _T5CON_NOT_SYNC_POSN                                0x2
#define _T5CON_NOT_SYNC_POSITION                            0x2
#define _T5CON_NOT_SYNC_SIZE                                0x1
#define _T5CON_NOT_SYNC_LENGTH                              0x1
#define _T5CON_NOT_SYNC_MASK                                0x4
#define _T5CON_ON_POSN                                      0x0
#define _T5CON_ON_POSITION                                  0x0
#define _T5CON_ON_SIZE                                      0x1
#define _T5CON_ON_LENGTH                                    0x1
#define _T5CON_ON_MASK                                      0x1
#define _T5CON_RD16_POSN                                    0x1
#define _T5CON_RD16_POSITION                                0x1
#define _T5CON_RD16_SIZE                                    0x1
#define _T5CON_RD16_LENGTH                                  0x1
#define _T5CON_RD16_MASK                                    0x2
#define _T5CON_nSYNC_POSN                                   0x2
#define _T5CON_nSYNC_POSITION                               0x2
#define _T5CON_nSYNC_SIZE                                   0x1
#define _T5CON_nSYNC_LENGTH                                 0x1
#define _T5CON_nSYNC_MASK                                   0x4
#define _T5CON_CKPS_POSN                                    0x4
#define _T5CON_CKPS_POSITION                                0x4
#define _T5CON_CKPS_SIZE                                    0x2
#define _T5CON_CKPS_LENGTH                                  0x2
#define _T5CON_CKPS_MASK                                    0x30
#define _T5CON_NOT_T5SYNC_POSN                              0x2
#define _T5CON_NOT_T5SYNC_POSITION                          0x2
#define _T5CON_NOT_T5SYNC_SIZE                              0x1
#define _T5CON_NOT_T5SYNC_LENGTH                            0x1
#define _T5CON_NOT_T5SYNC_MASK                              0x4
#define _T5CON_TMR5ON_POSN                                  0x0
#define _T5CON_TMR5ON_POSITION                              0x0
#define _T5CON_TMR5ON_SIZE                                  0x1
#define _T5CON_TMR5ON_LENGTH                                0x1
#define _T5CON_TMR5ON_MASK                                  0x1
#define _T5CON_T5RD16_POSN                                  0x1
#define _T5CON_T5RD16_POSITION                              0x1
#define _T5CON_T5RD16_SIZE                                  0x1
#define _T5CON_T5RD16_LENGTH                                0x1
#define _T5CON_T5RD16_MASK                                  0x2
#define _T5CON_nT5SYNC_POSN                                 0x2
#define _T5CON_nT5SYNC_POSITION                             0x2
#define _T5CON_nT5SYNC_SIZE                                 0x1
#define _T5CON_nT5SYNC_LENGTH                               0x1
#define _T5CON_nT5SYNC_MASK                                 0x4
#define _T5CON_T5CKPS0_POSN                                 0x4
#define _T5CON_T5CKPS0_POSITION                             0x4
#define _T5CON_T5CKPS0_SIZE                                 0x1
#define _T5CON_T5CKPS0_LENGTH                               0x1
#define _T5CON_T5CKPS0_MASK                                 0x10
#define _T5CON_T5CKPS1_POSN                                 0x5
#define _T5CON_T5CKPS1_POSITION                             0x5
#define _T5CON_T5CKPS1_SIZE                                 0x1
#define _T5CON_T5CKPS1_LENGTH                               0x1
#define _T5CON_T5CKPS1_MASK                                 0x20
#define _T5CON_CKPS0_POSN                                   0x4
#define _T5CON_CKPS0_POSITION                               0x4
#define _T5CON_CKPS0_SIZE                                   0x1
#define _T5CON_CKPS0_LENGTH                                 0x1
#define _T5CON_CKPS0_MASK                                   0x10
#define _T5CON_CKPS1_POSN                                   0x5
#define _T5CON_CKPS1_POSITION                               0x5
#define _T5CON_CKPS1_SIZE                                   0x1
#define _T5CON_CKPS1_LENGTH                                 0x1
#define _T5CON_CKPS1_MASK                                   0x20
#define _T5CON_RD165_POSN                                   0x1
#define _T5CON_RD165_POSITION                               0x1
#define _T5CON_RD165_SIZE                                   0x1
#define _T5CON_RD165_LENGTH                                 0x1
#define _T5CON_RD165_MASK                                   0x2

// Register: T5GCON
#define T5GCON T5GCON
extern volatile unsigned char           T5GCON              __at(0xFC4);
#ifndef _LIB_BUILD
asm("T5GCON equ 0FC4h");
#endif
// aliases
extern volatile unsigned char           _PR5                 __at(0xFC4);  // Note: Changed by MikroE
#ifndef _LIB_BUILD
asm("_PR5 equ 0FC4h");  // Note: Changed by MikroE
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO                  :1;
    };
} T5GCONbits_t;
extern volatile T5GCONbits_t T5GCONbits __at(0xFC4);
// bitfield macros
#define _T5GCON_GGO_NOT_DONE_POSN                           0x3
#define _T5GCON_GGO_NOT_DONE_POSITION                       0x3
#define _T5GCON_GGO_NOT_DONE_SIZE                           0x1
#define _T5GCON_GGO_NOT_DONE_LENGTH                         0x1
#define _T5GCON_GGO_NOT_DONE_MASK                           0x8
#define _T5GCON_GVAL_POSN                                   0x2
#define _T5GCON_GVAL_POSITION                               0x2
#define _T5GCON_GVAL_SIZE                                   0x1
#define _T5GCON_GVAL_LENGTH                                 0x1
#define _T5GCON_GVAL_MASK                                   0x4
#define _T5GCON_GGO_nDONE_POSN                              0x3
#define _T5GCON_GGO_nDONE_POSITION                          0x3
#define _T5GCON_GGO_nDONE_SIZE                              0x1
#define _T5GCON_GGO_nDONE_LENGTH                            0x1
#define _T5GCON_GGO_nDONE_MASK                              0x8
#define _T5GCON_GSPM_POSN                                   0x4
#define _T5GCON_GSPM_POSITION                               0x4
#define _T5GCON_GSPM_SIZE                                   0x1
#define _T5GCON_GSPM_LENGTH                                 0x1
#define _T5GCON_GSPM_MASK                                   0x10
#define _T5GCON_GTM_POSN                                    0x5
#define _T5GCON_GTM_POSITION                                0x5
#define _T5GCON_GTM_SIZE                                    0x1
#define _T5GCON_GTM_LENGTH                                  0x1
#define _T5GCON_GTM_MASK                                    0x20
#define _T5GCON_GPOL_POSN                                   0x6
#define _T5GCON_GPOL_POSITION                               0x6
#define _T5GCON_GPOL_SIZE                                   0x1
#define _T5GCON_GPOL_LENGTH                                 0x1
#define _T5GCON_GPOL_MASK                                   0x40
#define _T5GCON_GE_POSN                                     0x7
#define _T5GCON_GE_POSITION                                 0x7
#define _T5GCON_GE_SIZE                                     0x1
#define _T5GCON_GE_LENGTH                                   0x1
#define _T5GCON_GE_MASK                                     0x80
#define _T5GCON_T5GGO_NOT_DONE_POSN                         0x3
#define _T5GCON_T5GGO_NOT_DONE_POSITION                     0x3
#define _T5GCON_T5GGO_NOT_DONE_SIZE                         0x1
#define _T5GCON_T5GGO_NOT_DONE_LENGTH                       0x1
#define _T5GCON_T5GGO_NOT_DONE_MASK                         0x8
#define _T5GCON_T5GVAL_POSN                                 0x2
#define _T5GCON_T5GVAL_POSITION                             0x2
#define _T5GCON_T5GVAL_SIZE                                 0x1
#define _T5GCON_T5GVAL_LENGTH                               0x1
#define _T5GCON_T5GVAL_MASK                                 0x4
#define _T5GCON_T5GGO_nDONE_POSN                            0x3
#define _T5GCON_T5GGO_nDONE_POSITION                        0x3
#define _T5GCON_T5GGO_nDONE_SIZE                            0x1
#define _T5GCON_T5GGO_nDONE_LENGTH                          0x1
#define _T5GCON_T5GGO_nDONE_MASK                            0x8
#define _T5GCON_T5GSPM_POSN                                 0x4
#define _T5GCON_T5GSPM_POSITION                             0x4
#define _T5GCON_T5GSPM_SIZE                                 0x1
#define _T5GCON_T5GSPM_LENGTH                               0x1
#define _T5GCON_T5GSPM_MASK                                 0x10
#define _T5GCON_T5GTM_POSN                                  0x5
#define _T5GCON_T5GTM_POSITION                              0x5
#define _T5GCON_T5GTM_SIZE                                  0x1
#define _T5GCON_T5GTM_LENGTH                                0x1
#define _T5GCON_T5GTM_MASK                                  0x20
#define _T5GCON_T5GPOL_POSN                                 0x6
#define _T5GCON_T5GPOL_POSITION                             0x6
#define _T5GCON_T5GPOL_SIZE                                 0x1
#define _T5GCON_T5GPOL_LENGTH                               0x1
#define _T5GCON_T5GPOL_MASK                                 0x40
#define _T5GCON_T5GE_POSN                                   0x7
#define _T5GCON_T5GE_POSITION                               0x7
#define _T5GCON_T5GE_SIZE                                   0x1
#define _T5GCON_T5GE_LENGTH                                 0x1
#define _T5GCON_T5GE_MASK                                   0x80
#define _T5GCON_T5GGO_POSN                                  0x3
#define _T5GCON_T5GGO_POSITION                              0x3
#define _T5GCON_T5GGO_SIZE                                  0x1
#define _T5GCON_T5GGO_LENGTH                                0x1
#define _T5GCON_T5GGO_MASK                                  0x8
// alias bitfield definitions
typedef union {
    struct {
        unsigned                        :3;
        unsigned GGO_NOT_DONE           :1;
    };
    struct {
        unsigned                        :2;
        unsigned GVAL                   :1;
        unsigned GGO_nDONE              :1;
        unsigned GSPM                   :1;
        unsigned GTM                    :1;
        unsigned GPOL                   :1;
        unsigned GE                     :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO_NOT_DONE         :1;
    };
    struct {
        unsigned                        :2;
        unsigned T5GVAL                 :1;
        unsigned T5GGO_nDONE            :1;
        unsigned T5GSPM                 :1;
        unsigned T5GTM                  :1;
        unsigned T5GPOL                 :1;
        unsigned T5GE                   :1;
    };
    struct {
        unsigned                        :3;
        unsigned T5GGO                  :1;
    };
} PR5bits_t;
extern volatile PR5bits_t PR5bits __at(0xFC4);
// bitfield macros
#define _PR5_GGO_NOT_DONE_POSN                              0x3
#define _PR5_GGO_NOT_DONE_POSITION                          0x3
#define _PR5_GGO_NOT_DONE_SIZE                              0x1
#define _PR5_GGO_NOT_DONE_LENGTH                            0x1
#define _PR5_GGO_NOT_DONE_MASK                              0x8
#define _PR5_GVAL_POSN                                      0x2
#define _PR5_GVAL_POSITION                                  0x2
#define _PR5_GVAL_SIZE                                      0x1
#define _PR5_GVAL_LENGTH                                    0x1
#define _PR5_GVAL_MASK                                      0x4
#define _PR5_GGO_nDONE_POSN                                 0x3
#define _PR5_GGO_nDONE_POSITION                             0x3
#define _PR5_GGO_nDONE_SIZE                                 0x1
#define _PR5_GGO_nDONE_LENGTH                               0x1
#define _PR5_GGO_nDONE_MASK                                 0x8
#define _PR5_GSPM_POSN                                      0x4
#define _PR5_GSPM_POSITION                                  0x4
#define _PR5_GSPM_SIZE                                      0x1
#define _PR5_GSPM_LENGTH                                    0x1
#define _PR5_GSPM_MASK                                      0x10
#define _PR5_GTM_POSN                                       0x5
#define _PR5_GTM_POSITION                                   0x5
#define _PR5_GTM_SIZE                                       0x1
#define _PR5_GTM_LENGTH                                     0x1
#define _PR5_GTM_MASK                                       0x20
#define _PR5_GPOL_POSN                                      0x6
#define _PR5_GPOL_POSITION                                  0x6
#define _PR5_GPOL_SIZE                                      0x1
#define _PR5_GPOL_LENGTH                                    0x1
#define _PR5_GPOL_MASK                                      0x40
#define _PR5_GE_POSN                                        0x7
#define _PR5_GE_POSITION                                    0x7
#define _PR5_GE_SIZE                                        0x1
#define _PR5_GE_LENGTH                                      0x1
#define _PR5_GE_MASK                                        0x80
#define _PR5_T5GGO_NOT_DONE_POSN                            0x3
#define _PR5_T5GGO_NOT_DONE_POSITION                        0x3
#define _PR5_T5GGO_NOT_DONE_SIZE                            0x1
#define _PR5_T5GGO_NOT_DONE_LENGTH                          0x1
#define _PR5_T5GGO_NOT_DONE_MASK                            0x8
#define _PR5_T5GVAL_POSN                                    0x2
#define _PR5_T5GVAL_POSITION                                0x2
#define _PR5_T5GVAL_SIZE                                    0x1
#define _PR5_T5GVAL_LENGTH                                  0x1
#define _PR5_T5GVAL_MASK                                    0x4
#define _PR5_T5GGO_nDONE_POSN                               0x3
#define _PR5_T5GGO_nDONE_POSITION                           0x3
#define _PR5_T5GGO_nDONE_SIZE                               0x1
#define _PR5_T5GGO_nDONE_LENGTH                             0x1
#define _PR5_T5GGO_nDONE_MASK                               0x8
#define _PR5_T5GSPM_POSN                                    0x4
#define _PR5_T5GSPM_POSITION                                0x4
#define _PR5_T5GSPM_SIZE                                    0x1
#define _PR5_T5GSPM_LENGTH                                  0x1
#define _PR5_T5GSPM_MASK                                    0x10
#define _PR5_T5GTM_POSN                                     0x5
#define _PR5_T5GTM_POSITION                                 0x5
#define _PR5_T5GTM_SIZE                                     0x1
#define _PR5_T5GTM_LENGTH                                   0x1
#define _PR5_T5GTM_MASK                                     0x20
#define _PR5_T5GPOL_POSN                                    0x6
#define _PR5_T5GPOL_POSITION                                0x6
#define _PR5_T5GPOL_SIZE                                    0x1
#define _PR5_T5GPOL_LENGTH                                  0x1
#define _PR5_T5GPOL_MASK                                    0x40
#define _PR5_T5GE_POSN                                      0x7
#define _PR5_T5GE_POSITION                                  0x7
#define _PR5_T5GE_SIZE                                      0x1
#define _PR5_T5GE_LENGTH                                    0x1
#define _PR5_T5GE_MASK                                      0x80
#define _PR5_T5GGO_POSN                                     0x3
#define _PR5_T5GGO_POSITION                                 0x3
#define _PR5_T5GGO_SIZE                                     0x1
#define _PR5_T5GGO_LENGTH                                   0x1
#define _PR5_T5GGO_MASK                                     0x8

